{
  "cities": [
    {
      "id": "munich",
      "name": "Munich (MUC)",
      "country": "Germany",
      "countryCode": "DE",
      "centerCoordinates": [
        11.582,
        48.1351
      ],
      "pois": [
        {
          "id": "munich-marienplatz",
          "name": "Marienplatz",
          "coordinates": [
            11.5754485,
            48.1373932
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Munich's central square and heart of the city since 1158. Dominated by the New Town Hall with its famous Glockenspiel, this magnificent Gothic Revival building was constructed between 1867 and 1909. The Glockenspiel performs daily at 11am and 12pm (also at 5pm from March to October), featuring 43 bells and 32 life-sized figures that reenact historical Bavarian events. The square has been the focal point of Munich since the Middle Ages, serving as a marketplace and center of public life. Today it remains the heart of the pedestrian zone and a must-visit destination for tourists exploring Munich's rich history and culture.",
          "notes": "Glockenspiel at new town hall clock @17:00",
          "googleMapsUrl": "https://maps.google.com/?cid=16317814669314446971&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-viktualienmarkt",
          "name": "Viktualienmarkt",
          "coordinates": [
            11.5760761,
            48.1353899
          ],
          "category": "food",
          "visibility": "always",
          "description": "Munich's most famous gourmet food market. Features the city's most central beer garden where all six Munich breweries serve in rotation.",
          "notes": "Daily food market with gourmet specialties and beer garden",
          "googleMapsUrl": "https://maps.google.com/?cid=74772572163980675&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-glockenbachviertel",
          "name": "Glockenbachviertel",
          "coordinates": [
            11.5689144,
            48.1265524
          ],
          "category": "culture",
          "visibility": "always",
          "description": "Munich's historic LGBT district and vibrant nightlife hub - a gathering place for the gay community since the 1920s and features rainbow traffic lights.",
          "notes": "Gay district",
          "googleMapsUrl": "https://maps.google.com/?cid=17214784537254708958&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-st-peter-church",
          "name": "St. Peter Church",
          "coordinates": [
            11.5756044,
            48.1366805
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Munich's oldest parish church dating back to the 12th century. The 92-meter tower 'Alter Peter' offers spectacular panoramic views of the city and Alps from its 56-meter viewing platform.",
          "notes": "Climb \"Alter Peter\" tower for city views (300+ steps)",
          "googleMapsUrl": "https://maps.google.com/?cid=12579101524591160423&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-karlsplatz",
          "name": "Karlsplatz (Stachus)",
          "coordinates": [
            11.5660209,
            48.1392462
          ],
          "category": "practical",
          "visibility": "always",
          "description": "Major transportation hub and western gateway to Munich's pedestrian zone. Features the historic 14th-century Karlstor gate, underground shopping mall.",
          "notes": "Major square with Karlstor gate and shopping mall below",
          "googleMapsUrl": "https://maps.google.com/?cid=5986232855190454813&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-frauenkirche",
          "name": "Frauenkirche",
          "coordinates": [
            11.5730126,
            48.1386649
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Munich's iconic cathedral and most famous landmark with distinctive twin green-domed towers. Built 1468-1488, it features the legendary 'Devil's Footprint' - a black mark at the entrance linked to architectural trickery.",
          "notes": "Munich's most famous landmark with \"Devil's Footprint\"",
          "googleMapsUrl": "https://maps.google.com/?cid=12598930065456986&g_mp=Cidnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLlNlYXJjaFRleHQ",
          "photos": []
        },
        {
          "id": "munich-aloft-hotel",
          "name": "Aloft Munich",
          "coordinates": [
            11.5588983,
            48.1392677
          ],
          "category": "hotel",
          "description": "Near Munich Central Station",
          "notes": "Address: Bayerstraße 37, Munich, Germany 80335 - Phone: +49 89-5402370",
          "googleMapsUrl": "https://maps.app.goo.gl/nkZdiaoqJ2QSD3ASA",
          "photos": []
        }
      ]
    },
    {
      "id": "helsinki",
      "name": "Helsinki (HEL)",
      "country": "Finland",
      "countryCode": "FI",
      "centerCoordinates": [
        24.9384,
        60.1699
      ],
      "pois": [
        {
          "id": "helsinki-old-market-hall",
          "name": "Vanha kauppahalli - Old Market Hall",
          "coordinates": [
            24.9528226,
            60.1662146
          ],
          "category": "food",
          "description": "Historic indoor market hall, great for trying local foods like Karelian Pie.",
          "walkingTourNotes": "Brick-and-tan building along the harborfront offering more upscale food options than the basic outdoor market.",
          "notes": "Featured on 'Phil' Netflix show. Located near Market Square, perfect for gourmet food shopping and local delicacies.",
          "googleMapsUrl": "https://maps.app.goo.gl/rDT392jiWLmAHZq69",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-sibelius-monument",
          "name": "Sibelius Monument Vallikallio",
          "coordinates": [
            24.913429,
            60.1820451
          ],
          "category": "landmark",
          "description": "Abstract monument dedicated to Finnish composer Jean Sibelius, located in Sibelius Park.",
          "walkingTourNotes": "Monument honors Finland's most famous composer Jean Sibelius, featuring abstract organ pipe-like metal tubes that create a distinctive visual tribute to the composer's musical legacy.",
          "notes": "Rick Steves p.731. Beautiful park setting ideal for photos. The monument's unique design makes it one of Helsinki's most photographed attractions.",
          "googleMapsUrl": "https://maps.app.goo.gl/bJgz7JWUAb1idEg99",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-market-square",
          "name": "Kauppatori - Market Square",
          "coordinates": [
            24.9541698,
            60.1677083
          ],
          "category": "landmark",
          "description": "Helsinki's main outdoor market square, located at the South Harbour. A hub for food stalls and ferries. Features the Czarina's Stone obelisk, outdoor market stalls, and views of the harbor with Viking ships and the SkyWheel Helsinki Ferris wheel.",
          "walkingTourNotes": "The Czarina's Stone obelisk was the first public monument in Helsinki, designed by Carl Ludvig Engel and erected in 1835 to celebrate the first visit by Russian Czarina Alexandra and Czar Nicholas I. The square serves as the starting point for exploring the city's grand promenade.",
          "notes": "Explore colorful outdoor market with produce, fish, snacks, souvenirs, and crafts. Orange tents sell food, white tents sell souvenirs. Visit Old Market Hall for upscale food options. Harbor cruise boats depart from here. Rick Steves p.731.",
          "googleMapsUrl": "https://maps.app.goo.gl/GwVVFPTTwwcy1Xnw7",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-oodi-library",
          "name": "Oodi - Helsinki Central Library",
          "coordinates": [
            24.9379191,
            60.1736833
          ],
          "category": "culture",
          "description": "A stunning example of modern architecture and a vibrant public space. Helsinki's central library opened in 2018 to celebrate 101st birthday of Finland's independence. Swooping glass and wood building with facade covered in Finnish spruce planks, facing parliament and institutions of art, culture, and democracy.",
          "walkingTourNotes": "Oodi (pronounced 'awdi,' meaning 'ode') represents library of the future. One-third dedicated to books, rest is creative collection of anything community might need. Opened 2018 as gift to citizens celebrating independence.",
          "notes": "Free, daily 8:00-21:00. Loitering encouraged. Features intense chess games, sleeping zone, sewing stations, soundproof recording studios, game rooms, 3-D printer, sports gear lending (even skis), free meeting spaces. Don't miss Vera the robot. Grand central spiral staircase decorated with words describing welcome people (henpecked, chubby folk, babies, victims of war, fundamentalists, prudes, tourists—everybody). View terrace on top floor shows Kiasma Museum, parliament (1931), Helsinki Music Center, National Museum, Finlandia Hall, 1952 Olympic Stadium.",
          "googleMapsUrl": "https://maps.app.goo.gl/hLLbNeM7j2j1YJse9",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-senate-square",
          "name": "Senaatintori - Senate Square",
          "coordinates": [
            24.9522867,
            60.1694794
          ],
          "category": "landmark",
          "description": "A unique architectural square featuring Helsinki Cathedral and other neoclassical buildings. The finest Neoclassical square in Europe, designed by Carl Ludvig Engel after the 1808 fire. Features the Lutheran Cathedral with its grand staircase, statue of Czar Alexander II, and symmetrical government buildings.",
          "walkingTourNotes": "After Finland became a grand duchy of the Russian Empire, the czar sent German architect Carl Ludvig Engel (who had lived in St. Petersburg) to redesign the square in Neoclassical style. The square represents Helsinki's paradox: built by Russia with imported European architects in an intentionally European style. Czar Alexander II statue honors the czar who freed serfs and gave Finland more autonomy in 1863.",
          "notes": "Cathedral staircase is popular meeting and tanning spot. Yellow Senate building houses prime minister's office. Blue-gray stone building from 1757 (Helsinki City Museum) is one of few pre-Russian buildings surviving. National Library has world's finest Slavic book collection. Café Engel at Aleksanterinkatu 26 offers lunch and coffee. Rick Steves p.713.",
          "googleMapsUrl": "https://maps.app.goo.gl/iaJLSvxFbwfTqUJ7A",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-kamppi-chapel",
          "name": "Kamppi Chapel - Chapel of Silence",
          "coordinates": [
            24.9226601,
            60.1730277
          ],
          "category": "landmark",
          "description": "A serene wooden chapel located in a busy commercial area, offering a quiet retreat.",
          "walkingTourNotes": "Modern architectural landmark designed to provide a peaceful sanctuary in the heart of Helsinki's commercial district. The distinctive curved wood structure stands in striking contrast to its urban surroundings.",
          "notes": "Rick Steves p.730. Free to enter. Perfect escape from city bustle. Unique contemporary Finnish design.",
          "googleMapsUrl": "https://maps.app.goo.gl/vrhEDPSDZMvRT2Qg8",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-temppeliaukio-rock-church",
          "name": "Temppeliaukio Church - Rock Church",
          "coordinates": [
            24.9252647,
            60.1730122
          ],
          "category": "landmark",
          "description": "A Lutheran church built directly into solid rock, famous for its unique architecture and acoustics.",
          "walkingTourNotes": "Completed in 1969, this extraordinary church was carved directly into natural bedrock. The copper dome lets in natural light while the rough rock walls create exceptional acoustics, making it a popular concert venue.",
          "notes": "Rick Steves p.731. One of Helsinki's most popular attractions. Excellent acoustics for concerts. Small entrance fee. Can get crowded with tour groups.",
          "googleMapsUrl": "https://maps.app.goo.gl/JajobCKdFrgj1hhK7",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-esplanadi",
          "name": "Esplanadi",
          "coordinates": [
            24.9450346,
            60.1674841
          ],
          "category": "landmark",
          "description": "A beautiful pedestrian boulevard and urban park in the heart of Helsinki. Helsinki's top shopping boulevard with a park in the middle, stretching from Market Square toward Bulevardi. Features mature linden trees, elegant hotels, high-end shops, and cultural venues.",
          "walkingTourNotes": "Laid out in 1826 by Carl Ludvig Engel under Russian rule. The Francophile czars made the Esplanade feel like the Champs-Élysées—a bit of Paris in the north. Connected the old city (late 1700s) with new parts where neo-Renaissance stone houses would be built by late 1800s. Originally aspirational for rustic 1830s Helsinki (population only 10,000).",
          "notes": "Admire Hotel Kämp at #29, Galleria Kämp high-end fashion mall at #31, Strindberg Café for drinks. Swedish Theater at the top was built under Russian rule for Swedish residents. Academic Bookstore at #39 designed by Alvar Aalto has Café Aalto with ageless Aalto furniture.",
          "googleMapsUrl": "https://maps.app.goo.gl/FEpsMDAh54Pt17Ws5",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-design-district",
          "name": "Design District",
          "coordinates": [
            24.9370194,
            60.1642385
          ],
          "category": "culture",
          "description": "A neighborhood filled with design and antique shops, fashion stores, museums, and galleries.",
          "walkingTourNotes": "Helsinki's creative hub showcasing Finnish design heritage and contemporary innovation. The district encompasses multiple streets filled with boutiques, studios, and cultural institutions celebrating Finnish aesthetic excellence.",
          "notes": "Design Museum serves as central starting point. Great for shopping Finnish design, fashion, and art. Allow 2-3 hours to explore properly.",
          "googleMapsUrl": "https://maps.app.goo.gl/EwUuHFEstV3fbqXY9",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-suomenlinna",
          "name": "Suomenlinna",
          "coordinates": [
            24.9790427,
            60.1496082
          ],
          "category": "landmark",
          "description": "An 18th-century sea fortress and UNESCO World Heritage site spread across a group of islands.",
          "walkingTourNotes": "Built in the 18th century when Finland was part of Sweden to protect against Russian expansion. Later used by Russians after 1808, and by independent Finland after 1917. Now a living museum and residential area with museums, parks, and historic fortifications.",
          "notes": "Fortress island accessible by ferry from Market Square. UNESCO World Heritage site. Allow half-day minimum to explore. Ferry arrives at main pier. Great for picnics and walking.",
          "googleMapsUrl": "https://maps.app.goo.gl/AzS7J3APAo8HoaGo8",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "helsinki-cafe-kappeli",
          "name": "Café Kappeli",
          "coordinates": [
            24.9472,
            60.1673
          ],
          "category": "food",
          "visibility": "always",
          "description": "Old-fashioned, gazebo-like café offering coffee, pastries, and relaxation in an oasis of Old World atmosphere. Located on the Esplanade's grassy median near Market Square.",
          "walkingTourNotes": "In the 19th century, Café Kappeli was a popular hangout for local intellectuals and artists. Today it continues as a beloved Helsinki institution with its distinctive iron-and-glass structure hidden among linden trees.",
          "notes": "Self-serve counter with sit-anywhere seating. Locals love salmon and soup-and-bread lunch specials with free seconds. Bandstand in front hosts nearly daily music and dance performances in summer. Great cup-of-coffee memory for romantic tourists.",
          "googleMapsUrl": "https://maps.app.goo.gl/PdRh2c6w5d6CMHY88",
          "photos": []
        },
        {
          "id": "helsinki-iittala-arabia-aarikka",
          "name": "Iittala, Arabia & Aarikka",
          "coordinates": [
            24.9467,
            60.1675
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Cluster of beloved Finnish design shops showcasing practical, affordable Nordic aesthetic. Iittala features classic Finnish glassware, Arabia offers ceramic pieces since 1873, and Aarikka specializes in clothing, jewelry, and home goods.",
          "walkingTourNotes": "Arabia has been recognized as a mark of quality and unpretentious class since 1873. Their ceramic pieces are considered lifelong investments in everyday luxury, with warm colors beloved in the land of long dark winters. Iittala is its sister brand with iconic glassware.",
          "notes": "Located directly across from Café Kappeli on the Esplanade. Design is big for Finns—these shops represent the Finnish commitment to practical everyday luxury with simple Nordic aesthetic.",
          "googleMapsUrl": "https://maps.app.goo.gl/66rneXeFQWSZHxRw8",
          "photos": []
        },
        {
          "id": "helsinki-artek-marimekko-stockmann",
          "name": "Artek, Marimekko & Stockmann",
          "coordinates": [
            24.9420,
            60.1686
          ],
          "category": "practical",
          "visibility": "walkingTour",
          "description": "Pedestrianized Keskuskatu street featuring Finland's most famous design and retail landmarks. Artek showcases Alvar Aalto furniture, Marimekko displays bold colorful patterns, and Stockmann is the city's biggest, best, and oldest department store.",
          "walkingTourNotes": "Artek founded in 1935 by Alvar Aalto to showcase his practical, modern furniture and housewares designs. Marimekko became Finland's most famous fabric design export with patterns adorning everything from purses to shower curtains. Stockmann has anchored Helsinki shopping for generations.",
          "notes": "Multiple Marimekko branches within a block. Stockmann has sprawling supermarket in basement. Located around corner from Academic Bookstore at end of Esplanade.",
          "googleMapsUrl": "https://maps.app.goo.gl/HsYTWtDCqC2AYjRK6",
          "photos": []
        },
        {
          "id": "helsinki-three-blacksmiths",
          "name": "Three Blacksmiths",
          "coordinates": [
            24.9412,
            60.1690
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "1932 statue at the corner of Keskuskatu and Aleksanterinkatu celebrating human labor and cooperation, showing the solid character of Finnish people. Bears surviving shrapnel damage from WWII.",
          "walkingTourNotes": "Most interpretations say it celebrates human labor and cooperation. Shrapnel damage on base from WWII when Russia invaded Finland (1939-1940 Winter War, 1941-1944 Continuation War) to reclaim their lost buffer zone. Finland held fast and emerged with freedom and relatively little damage.",
          "notes": "Stockmann's entrance facing Three Blacksmiths is city's most popular meeting point under the clock. Everyone in Finland knows 'Let's meet under the clock.' Old Student Hall across street decorated with legendary Finnish heroes.",
          "googleMapsUrl": "https://maps.app.goo.gl/8K1QvBHWim7B1SHX8",
          "photos": []
        },
        {
          "id": "helsinki-central-train-station",
          "name": "Central Train Station",
          "coordinates": [
            24.9414,
            60.1719
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Helsinki landmark designed by Eliel Saarinen featuring big stern figures carrying illuminated globes on facade. Inside: grand main hall with early 20th-century architectural razzle-dazzle and Olivia Restaurant.",
          "walkingTourNotes": "Designed by Eliel Saarinen, one of the two men who remade Helsinki. The granite giants on facade seem to have stepped right out of Nordic myth. Station once connected Helsinki to St. Petersburg (4 hours), Moscow (overnight), and all the way to Hong Kong with just two changes.",
          "notes": "Peek into Olivia Restaurant inside (on left) for architectural details. Ateneum (Finland's national gallery) diagonally across square to left. Finnish National Theater founded to promote Finnish-speaking theater faces station.",
          "googleMapsUrl": "https://maps.app.goo.gl/qwb75swVmTisq3wp8",
          "photos": []
        },
        {
          "id": "helsinki-hotel-u14",
          "name": "Hotel U14, Autograph Collection",
          "coordinates": [
            24.9486334,
            60.1649695
          ],
          "category": "hotel",
          "description": "Boutique hotel part of Marriott's Autograph Collection, located in the heart of Helsinki with unique design and personalized service.",
          "notes": "Address: Unioninkatu 14, Helsinki, Finland 00130 - Phone: +35 829 3141414",
          "googleMapsUrl": "https://maps.app.goo.gl/yGR7QQMFpH5wNR3cA",
          "photos": []
        }
      ]
    },
    {
      "id": "tallinn",
      "name": "Tallinn (TLL)",
      "country": "Estonia",
      "countryCode": "EE",
      "centerCoordinates": [
        24.7536,
        59.437
      ],
      "pois": [
        {
          "id": "tallinn-kgb-prison-cells",
          "name": "KGB Prison Cells",
          "coordinates": [
            24.7474744,
            59.4407311
          ],
          "category": "culture",
          "description": "Former KGB prison cells preserved as a museum showcasing the dark history of Soviet occupation. Experience the harsh reality of political imprisonment during Estonia's Soviet era.",
          "notes": "rs,p784",
          "googleMapsUrl": "https://maps.app.goo.gl/DA6YvLM4c1yr5ELx6?g_st=ipc",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-depeche-mode-baar",
          "name": "Depeche Mode Baar",
          "coordinates": [
            24.7439538,
            59.4375343
          ],
          "category": "culture",
          "description": "Unique themed bar dedicated to the British electronic band Depeche Mode. A cult destination for fans featuring band memorabilia, themed cocktails, and regular tribute nights.",
          "notes": "Carved Stone Museum",
          "googleMapsUrl": "https://maps.app.goo.gl/93AQ2wU5yHwB7cJv6?g_st=ipc",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-carved-stone-museum",
          "name": "Carved Stone Museum",
          "coordinates": [
            24.7412552,
            59.4348093
          ],
          "category": "culture",
          "description": "",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/hS7ejrsTAwFuMgKBA?g_st=ipc",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-patkuli-viewing-platform",
          "name": "Patkuli Viewing Platform",
          "coordinates": [
            24.7410591,
            59.4385858
          ],
          "category": "landmark",
          "description": "Scenic viewing platform offering panoramic views over Tallinn's medieval Old Town, the harbor, and modern city beyond. One of the best photography spots in Tallinn.",
          "walkingTourNotes": "Located on Toompea (upper town) hill, this viewing platform has offered visitors commanding views of the lower town and harbor for centuries. The name Patkuli comes from Johann Reinhold Patkul, a Swedish-born Estonian noble who defended Estonian rights in the late 17th century. Views include the old moat, ferries to Helsinki (50 miles away), St. Olav's Church (once 98 feet taller), and the 1,000-foot TV tower (site of 1991 standoff between Soviet paratroopers and Estonian patriots). During Soviet times, Finnish TV was crucial for Estonians' only look at Western lifestyles.",
          "notes": "Best spot for panoramic photos of the Old Town's red rooftops. Free access. Located along Toompea with grand view. Big city map on site to trace your walking route. Access through arch from Rahukohtu lane. Especially beautiful at sunset or blue hour.",
          "googleMapsUrl": "https://maps.app.goo.gl/LDEvQDb5GoXHNfzq9",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-alexander-nevsky-cathedral",
          "name": "Alexander Nevsky Cathedral",
          "coordinates": [
            24.739097,
            59.4358533
          ],
          "category": "landmark",
          "description": "Striking Russian Orthodox cathedral built in 1900 during the Russian Empire period. Features distinctive onion domes and ornate Russian Orthodox architecture, representing a period many Estonians would prefer to forget.",
          "walkingTourNotes": "Built in 1900 on Toompea (seat of Estonian government) during the period of late 19th-century Russification under Czar Alexander III. Named after Russian warrior prince Alexander Nevsky who defeated German crusaders in 1242. The cathedral's prominent position on Toompea hill was deliberately chosen to assert Russian dominance, facing the traditional Estonian seat of power over the supposed grave of legendary Estonian hero Kalevipoeg. Russians tore down a statue of Martin Luther to make room. After Estonian independence in 1991, the cathedral remains controversial as a symbol of Russian occupation, though it's now recognized as an important architectural monument.",
          "notes": "Free entry, daily 8:00-18:00 (Sat until 19:00). Services daily at 8:30 and 17:00 - OK to visit discreetly. Exquisitely renovated interior with glittering icons, iconostasis screen, no pews (worshippers stand), heavy incense creating mystical atmosphere. Buy candles to light a prayer at desk by door. About 40% of Tallinn's population is ethnic Russian.",
          "googleMapsUrl": "https://maps.app.goo.gl/Mhshgtfc3LoGZuvUA",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-kiek-in-de-kok",
          "name": "Kiek in de Kök Museum and Bastion Tunnels",
          "coordinates": [
            24.7407135,
            59.4346895
          ],
          "category": "culture",
          "description": "Medieval defense tower and underground bastion tunnels system. The name means 'Peek into the Kitchen' in Low German - soldiers could look down into houses from the tower. Now a museum of medieval warfare and fortifications.",
          "walkingTourNotes": "Built in the 15th century as part of Tallinn's defensive system, this massive artillery tower was one of the most formidable fortifications in Northern Europe. The 38-meter tower has walls up to 4 meters thick. The name 'Kiek in de Kök' (Peek into the Kitchen) comes from the fact that guards standing atop the tower could see into the kitchens of nearby houses. The bastion tunnels beneath were built in the 17th-18th centuries by Swedish rulers to strengthen city defenses.",
          "notes": "Museum entry fee required. Tour the medieval tower and explore underground Swedish-era bastion tunnels. Exhibits on medieval warfare, city fortifications, and daily life. Allow 1-2 hours for full visit. Combined ticket with other museums available.",
          "googleMapsUrl": "https://maps.app.goo.gl/2bXGDvQ2ynL7eYwQA",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-fat-margaret",
          "name": "Fat Margaret Tower (Paks Margareeta)",
          "coordinates": [
            24.7490878,
            59.442611
          ],
          "category": "landmark",
          "description": "Massive 16th-century cannon tower guarding Tallinn's harbor entrance. Now houses the Estonian Maritime Museum. Named for its thick defensive walls built to withstand cannon fire.",
          "walkingTourNotes": "This tower guarded the entry gate of the town in medieval times when the sea came much closer. Built during Hanseatic times when Sweden took Estonia from the German Teutonic Knights (16th century plaque above gate). Besides being a defensive outpost, the tower was made big to intimidate anyone coming to town from the harbor. Named for its thick walls necessary to defend against 16th-century cannon balls.",
          "notes": "Starting point for the Tallinn Walk. Look for the 16th-century plaque above the gate. Houses Estonian Maritime Museum. The tower's impressive size was meant to both defend and intimidate approaching visitors.",
          "googleMapsUrl": "https://maps.app.goo.gl/zN2oNHmjML9bfabL6",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "tallinn-pikk-street",
          "name": "Pikk Street",
          "coordinates": [
            24.747809,
            59.440579
          ],
          "category": "landmark",
          "description": "Tallinn's main medieval merchants' street leading from harbor to town, lined with historic warehouses featuring gables and cranes. Notable landmarks include the 'Three Sisters' merchant buildings and St. Olav's Church with its distinctive spire.",
          "walkingTourNotes": "Literally meaning 'Long Street,' this was the economic artery of medieval Tallinn, built with Hanseatic money from trade in salt, furs, fish, weapons, and spices. The street showcases the wealth of German merchants during the 15th-16th century golden age. The Three Sisters buildings are textbook examples of merchant home/warehouse/office from Hanseatic times. St. Olav's Church once had the world's tallest spire (1492) which helped ships navigate and served as a lightning rod.",
          "notes": "Walk from Fat Margaret Tower uphill into town. Look for Three Sisters buildings and ornate carved doors showing merchant wealth. St. Olav's Church tower offers great views (234 stairs, €5, April-Oct only). Church is free, daily 10:00-18:00. Notice the KGB building at Pikk 59 - second house after St. Olav's with bricked-up windows.",
          "googleMapsUrl": "https://www.google.com/maps/search/?api=1&query=Pikk,+Tallinn",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-brotherhood-black-heads",
          "name": "Brotherhood of the Black Heads",
          "coordinates": [
            24.746728,
            59.438914
          ],
          "category": "landmark",
          "description": "Ornate 1440 building with decorative reliefs, once home to a German merchants' club for unmarried men. Features the 'black head' of St. Maurice above an elaborate doorway.",
          "walkingTourNotes": "Built in 1440 and used as a German merchants' club for nearly 500 years until Hitler invited Estonian Germans back in the 1930s. The Brotherhood was for single German men (bachelors deployed first in fires/battles). When a member married locally, he joined the Great Guild and gained economic/political status. Named after St. Maurice, an early Christian soldier-martyr beheaded in the 3rd century for refusing to honor Roman gods.",
          "notes": "Now a concert venue, you can peek inside and use the WC. Located at Pikk 26 with an extremely ornate doorway. Look for reliefs recalling Tallinn's Hanseatic glory days.",
          "googleMapsUrl": "https://www.google.com/maps/search/?api=1&query=59.438914,24.746728",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-great-guild-hall",
          "name": "Great Guild Hall (Suurgildi Hoone)",
          "coordinates": [
            24.744955,
            59.4384381
          ],
          "category": "culture",
          "description": "Wide-fronted yellow building showcasing Hanseatic wealth, now home to the Museum of Estonian History. The hall belonged to Tallinn's most prestigious merchant guild.",
          "walkingTourNotes": "Built with a wide (heavily taxed) front as the epitome of Hanseatic wealth and prestige. Home to the Great Guild, the most powerful of Tallinn's merchant guilds during the city's economic golden age. German merchants who married into local families and left the Brotherhood of Black Heads would join this elite guild.",
          "notes": "Located at Pikk 17 across from Church of the Holy Ghost. Houses the worthwhile Museum of Estonian History offering a concise survey of Estonia's story.",
          "googleMapsUrl": "https://maps.app.goo.gl/uajizJt1Lq6G8Q9w6",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-church-holy-ghost",
          "name": "Church of the Holy Ghost (Pühavaimu Kirik)",
          "coordinates": [
            24.7455909,
            59.4381251
          ],
          "category": "landmark",
          "description": "Pretty medieval church with outdoor clock from 1633, featuring a 14th-century interior with wooden balcony and pulpit painted with biblical scenes for the illiterate.",
          "walkingTourNotes": "Retains its 14th-century layout with creaky wooden floors and lovingly crafted details. The pulpit features the 'poor man's Bible' - painted scenes to inspire the illiterate. The old Tallinn flag (red-and-white Danish) recalls 13th-century Danish rule - 'Tallinn' means 'Danish Town.' Danes sold the city to German Teutonic Knights, who lost it to Swedes, who lost it to Russians. Most windows date from the 1990s.",
          "notes": "€2 entry, Mon-Fri 10:00-18:00, Sat from 11:00, closed most Sundays. Lutheran services Sun 13:00, free concerts Mon 20:00. Located at Pühavaimu 2. Plaque on wall is in Estonian and Russian (pre-1991 'inner tourism' era).",
          "googleMapsUrl": "https://maps.app.goo.gl/WCY2Atjwg62nRHT49",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-town-hall-square",
          "name": "Town Hall Square (Raekoja Plats)",
          "coordinates": [
            24.7450067,
            59.4371575
          ],
          "category": "landmark",
          "description": "The focal point of medieval Tallinn's autonomous lower town, surrounded by colorful buildings and dominated by the 15th-century Town Hall. Once a marketplace for centuries, now filled with cafes and tourists.",
          "walkingTourNotes": "Center of the autonomous lower town, a merchant city of Hanseatic traders. In medieval times, criminals were chained to pillories for public humiliation and knights showed off in tournaments. Europe's oldest continuously operating pharmacy (Raeapteek, dating from 1422) sits at the square entrance. The 15th-century Town Hall houses a tower offering commanding views.",
          "notes": "Raeapteek pharmacy open Mon-Sat 10:00-18:00, still operating with medieval painted ceiling beams and historical exhibits. Town Hall open in summer with tower climb available. Square ringed by touristy eateries. TI one block away.",
          "googleMapsUrl": "https://maps.app.goo.gl/XdfskCW2uVaystFq6",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-st-nicholas-church",
          "name": "St. Nicholas Church (Niguliste Kirik)",
          "coordinates": [
            24.742756,
            59.435922
          ],
          "category": "culture",
          "description": "13th-century Gothic church turned art museum, featuring medieval religious art including Herman Rode's 1481 altarpiece and Bernt Notke's Dance of Death. Glass elevator to bell tower for views.",
          "walkingTourNotes": "Built in the 13th century to serve German merchants and knights. On March 9, 1944, Soviet forces bombed Tallinn while under German control, burning out the church and surrounding medieval district. Only the church was rebuilt. Now houses fine Gothic-era religious art. The Rode altarpiece shows Lübeck's skyline alongside St. Nicholas scenes. The Dance of Death fragment (originally 100 feet long) shows skeletons approaching people from all walks of life - a medieval reminder that life is fleeting.",
          "notes": "€12 entry, Tue-Sun 10:00-18:00, closed Mon year-round. Free organ or choir concerts Sat-Sun at 16:00 with ticket. Enter through modern cellar with WWII destruction photos. Located on Rüütli street.",
          "googleMapsUrl": "https://maps.app.goo.gl/XRK7nAWS6J5i8KYRA",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-city-walls-gardens",
          "name": "City Walls and Gardens",
          "coordinates": [
            24.740714,
            59.434890
          ],
          "category": "landmark",
          "description": "View terrace known as Danish King's Garden with medieval city walls. Tallinn's walls once had 46 towers, 26 still standing. Includes the Kiek in de Kök tower with steep staircases and medieval exhibits.",
          "walkingTourNotes": "Gifted to the lower town by the Danish King in 1311. According to legend, during a losing battle here, a white cross fell from heaven into a pool of blood, inspiring the Danes to victory - hence Denmark's flag design (white cross on red). The imposing walls mark the official boundary between lower and upper towns. Kiek in de Kök means 'Peek in the Kitchen' in Low German - guards could literally see into townspeople's homes from this tower.",
          "notes": "The view terrace is free to access. Kiek in de Kök tower costs €8 (combo-ticket with Neitsitorn tower), closed Mon off-season. Extremely tight, twisty stone staircases inside. Exhibits include cannons, model ships, and castle models from Tallinn's medieval heyday.",
          "googleMapsUrl": "https://www.google.com/maps/search/?api=1&query=59.434890,24.740714",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-toompea-castle",
          "name": "Toompea Castle (Toompea Loss)",
          "coordinates": [
            24.7348994,
            59.4357455
          ],
          "category": "landmark",
          "description": "Pink palace with 18th-century Russian addition onto medieval castle, now the Estonian Parliament (Riigikogu) building. Flies the Estonian flag with three lions and oak leaves symbolizing strength and stubbornness.",
          "walkingTourNotes": "The pink palace is an 18th-century Russian addition to the medieval Toompea Castle. Today houses the Estonian Parliament flying the flag of both the first (1918-1940) and second (1991-present) Estonian republics. The Estonian seal shows three lions for three great battles and oak leaves for strength and stubbornness. Ancient pagan Estonians believed spirits lived in oak trees and would walk through oak forests to toughen up. Estonian cemeteries are still in forests, keeping some pagan sensibilities that spirits of the departed live in trees.",
          "notes": "Seat of Estonian government on Toompea hill. The pink palace faces Alexander Nevsky Cathedral across the square. Look for the Estonian flag and seal. Access Tall Hermann Tower through the park gate to the left of the palace.",
          "googleMapsUrl": "https://maps.app.goo.gl/rBrnXsXGgAmqW6T89",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-tall-hermann-tower",
          "name": "Tall Hermann Tower (Pikk Hermann)",
          "coordinates": [
            24.7369546,
            59.4352478
          ],
          "category": "landmark",
          "description": "Tallest tower of Toompea Castle wall and powerful symbol of Estonian independence. For 50 years during Soviet occupation, the red Soviet flag flew here. Now flies the Estonian blue, black, and white flag.",
          "walkingTourNotes": "Built in 1371, obtained current height (45.6m) and shape in late 15th century. The flag on top at 95 meters above sea level is one of the main symbols of national government. While Estonian flags were hidden in cellars during 50 years of Soviet occupation, the Soviet flag flew from Tall Hermann. As the USSR unraveled, Estonians defiantly replaced the red Soviet flag with their own blue, black, and white flag - a powerful moment of national rebirth.",
          "notes": "Located at the south-western corner of Toompea Castle. A narrow stone staircase of 215 steps leads to the top. Access through the gate in the park to the left of the pink palace. Symbol of Estonian independence and resilience.",
          "googleMapsUrl": "https://maps.app.goo.gl/tz3MSXUNwaP6LeJX8",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-dome-church",
          "name": "Dome Church (Toomkirik)",
          "coordinates": [
            24.7389901,
            59.4370958
          ],
          "category": "landmark",
          "description": "St. Mary's Cathedral, officially Lutheran but in a country that's the least religious in the EU. Perfect example of simple Northern European Gothic built 13th century during Danish rule, rebuilt after 1684 fire.",
          "walkingTourNotes": "Built in the 13th century during Danish rule, then rebuilt after a 1684 fire. Once the church of Tallinn's wealthy German-speaking aristocracy, littered with over 100 coats of arms carved by local masters as memorials to the deceased with German tributes. Earliest dates from 1600s, latest from around 1900. Estonia is ostensibly Lutheran but only 14% identify religion as important (Gallup Poll shows Estonia as least religious EU country). Most churches now double as concert venues or museums.",
          "notes": "€2 entry, €5 for 140-step Baroque tower climb. Daily 10:00-17:00. Organ recitals Sat at 12:00. Still used for worship unlike most Tallinn churches. Located on Toom-Kooli street.",
          "googleMapsUrl": "https://maps.app.goo.gl/XWiap813VnaEzSwRA",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-kohtuotsa-viewpoint",
          "name": "Kohtuotsa Viewpoint",
          "coordinates": [
            24.7418796,
            59.437807
          ],
          "category": "landmark",
          "description": "Popular viewpoint on Toompea Hill offering breathtaking panoramic views of Old Town spires, the cruise port, and the contrast between medieval architecture and Soviet-era apartment blocks.",
          "walkingTourNotes": "From left to right, the view shows St. Olav's Church, the busy cruise port, Church of the Holy Ghost's white spire, 16th-century Town Hall tower, and St. Nicholas Church tower. Below, Pikk street (Tallinn's historic main drag) winds from Toompea Castle downhill through the gate tower, past Church of the Holy Ghost, behind St. Olav's, out to the harbor. Soviet-era apartment blocks on distant horizon are being crowded out by modern high-rises. Hotel Viru (white skyscraper) was the biggest hotel in the Baltics in Soviet times, now sits above Viru Keskus mall. The Rotermann Quarter (between Viru and ferry terminals) is a revamped industrial area now trendy commercial zone.",
          "notes": "Free 24/7 access at Kohtu 12, 10130 Tallinn. One of the city's most popular viewpoints. After viewing, descend via Kohtu street, past Finnish Embassy, turn left at onion domes down Pikk Jalg ('Long Leg Lane'), under the tower, straight on Pikk street.",
          "googleMapsUrl": "https://maps.app.goo.gl/FBeptHUUZMB7We4X7",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-viru-gate",
          "name": "Viru Gate",
          "coordinates": [
            24.750131,
            59.4365785
          ],
          "category": "landmark",
          "description": "Two iconic round tower gates marking the end of old Tallinn and entrance to the Old Town. Medieval towers from the city's defensive walls.",
          "walkingTourNotes": "Part of the Walls of Tallinn that once completely encircled the city. These twin towers are among the most photographed landmarks in Tallinn and served as defensive structures during medieval times. The gates lead from the Old Town to the modern city, with Viru street running between them. Above the flower stalls to the right is a small park on an old bastion known as Kissing Hill (visit after dark to find out why).",
          "notes": "Located at Viru tänav, marking the transition from medieval Old Town to modern Tallinn. Walk between the towers on Viru street. Beyond the gates is the Rotermann Quarter (left) and Hotel Viru straight ahead. Free to visit anytime. Perfect photo opportunity.",
          "googleMapsUrl": "https://maps.app.goo.gl/EtJks3Z42QYsuiTf8",
          "photos": [],
          "visibility": "walkingTour"
        },
        {
          "id": "tallinn-hotel-viru-kgb",
          "name": "Hotel Viru & KGB Museum",
          "coordinates": [
            24.7523231,
            59.4365106
          ],
          "category": "culture",
          "description": "Soviet-era hotel built in 1972, the first modern hotel in Tallinn. The 23rd floor housed a secret KGB surveillance operation. Now features a KGB Museum showcasing original equipment and operations from the Soviet occupation. Free view bar on 23rd floor.",
          "walkingTourNotes": "Built in 1972 as Tallinn's first skyscraper and luxury hotel during Soviet times, designed to accommodate foreign visitors. The KGB secretly operated from the sealed 23rd floor, monitoring guests and diplomats. The hotel's microphones, hidden cameras, and listening equipment were only discovered after Estonian independence in 1991. The 23rd floor has been preserved as a museum since 2011. The iconic white skyscraper was the biggest hotel in the Baltics during Soviet times.",
          "notes": "rs,p784 - KGB Museum tour highly recommended for understanding Soviet occupation. Must book guided tour in advance. Tours run daily, last 45-60 minutes. Museum shows original KGB surveillance equipment, listening devices, and operations. Viewing the old equipment and hearing stories brings Soviet-era surveillance to life. Hotel still operates today as Original Sokos Hotel Viru. Great free view bar on 23rd floor. Located next to modern Viru Keskus mall.",
          "googleMapsUrl": "https://maps.app.goo.gl/d3u36SNC9vifzeFGA",
          "photos": [],
          "visibility": "always"
        }
      ]
    },
    {
      "id": "stockholm",
      "name": "Stockholm (ARN)",
      "country": "Sweden",
      "countryCode": "SE",
      "centerCoordinates": [
        18.0686,
        59.3293
      ],
      "pois": [
        {
          "id": "stockholm-gamla-stan",
          "name": "Gamla Stan",
          "coordinates": [
            18.0718675,
            59.3256954
          ],
          "category": "landmark",
          "description": "Stockholm's historic Old Town island, one of the largest and best-preserved medieval city centers in Europe. Featuring cobblestone streets, colorful 17th-18th century buildings, and the Royal Palace.",
          "notes": "Historic Old Town island - explore cobblestone streets and colorful buildings",
          "googleMapsUrl": "https://maps.app.goo.gl/N1o4aSVZxjeHxASDA",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "stockholm-skansen",
          "name": "Skansen",
          "coordinates": [
            18.1025,
            59.326
          ],
          "category": "culture",
          "description": "World's first open-air folk museum and zoo, showcasing Swedish history and culture through historic buildings, traditional crafts, and Nordic animals including bears, wolves, and reindeer.",
          "notes": "rs,p584",
          "googleMapsUrl": "https://maps.app.goo.gl/hzcygcgp25gRpRq19",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "stockholm-vasa-museum",
          "name": "Vasa Museum",
          "coordinates": [
            18.0916,
            59.328
          ],
          "category": "culture",
          "description": "Maritime museum housing the 17th-century warship Vasa, which sank on its maiden voyage in 1628 and was salvaged 333 years later. The ship is 95% original and remarkably well-preserved. Watch the film, take free guided tour. Audiobook tour available",
          "notes": "rs,p586",
          "googleMapsUrl": "https://maps.app.goo.gl/uCGBs3QVe8eheBoG6",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "stockholm-fotografiska",
          "name": "Anton Corbijn | Fotografiska Stockholm",
          "coordinates": [
            18.0845,
            59.3181
          ],
          "category": "culture",
          "description": "Contemporary photography museum featuring world-class exhibitions. The Anton Corbijn exhibition showcases iconic portraits of musicians and celebrities by the renowned Dutch photographer.",
          "notes": "rs,p594 - Check the exhibit date!!",
          "googleMapsUrl": "https://maps.app.goo.gl/krsXpM7MiCheaiTBA",
          "photos": [],
          "visibility": "always"
        },
        {
          "id": "stockholm-sheraton-hotel",
          "name": "Sheraton Stockholm Hotel",
          "coordinates": [
            18.0590408,
            59.3290754
          ],
          "category": "hotel",
          "description": "Premium hotel located on Södermalm island with stunning views of Stockholm's Old Town and waterfront. Perfect location for exploring the city.",
          "notes": "Address: Tegelbacken 6, 101 23 Stockholm, Sweden 10123 - Phone: +4684123400",
          "googleMapsUrl": "https://maps.app.goo.gl/p2DwGtkK9rYMv9368",
          "photos": []
        },
        {
          "id": "stockholm-royal-palace",
          "name": "Royal Palace (Kungliga Slottet)",
          "coordinates": [
            18.0717194,
            59.3268215
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Built in the 1700s on the site of Stockholm's first castle. Gustav III transformed Stockholm from a dowdy Scandinavian port into a sophisticated European capital modeled on French culture. Features the grand entry to the Royal Palace with the changing of the guard ceremony.",
          "walkingTourNotes": "Gustav III founded the Royal Dramatic Theater and the Royal Opera in Stockholm. He was ironically assassinated by a discontented nobleman who shot Gustav in the back at a masquerade ball at the Royal Opera House in 1792, inspiring Verdi's opera Un Ballo in Maschera.",
          "notes": "Palace facade finished in 1754, replacing one that burned in 1697. Inside passage features the royal chapel (free, Baroque) and Hall of State with 1650 throne. Changing of the guard ceremony in courtyard. Rick Steves pages 556-557.",
          "googleMapsUrl": "https://maps.app.goo.gl/488fzuoFUJrid2146",
          "photos": []
        },
        {
          "id": "stockholm-storkyrkan",
          "name": "Storkyrkan (Stockholm Cathedral)",
          "coordinates": [
            18.0703865,
            59.3257658
          ],
          "category": "culture",
          "visibility": "always",
          "description": "Stockholm's Gothic cathedral from the 14th century, with painted stonework. Stockholm's oldest church featuring many styles from medieval to modern, guarded by statues of Caution and Hope at the gate.",
          "walkingTourNotes": "Baroque facade added to match newer palace. Olaus Petri's tombstone under pulpit - he was a Swedish reformer who befriended Gustav Vasa and guided him in Lutheranizing Sweden, turning this cathedral from Catholic to Protestant. Petri was a witness to Stockholm Bloodbath and nearly executed himself.",
          "notes": "Cost 85 SEK, daily 9:00-18:00. Features: centuries-old tombstones, bronze plaque recalling 1925 ecumenical meeting, carved wood royal boxes (1684), 17th-century silver and ebony altar, 1489 St. George statue carved from oak and elk horn (gnarliest dragon's head in Europe), 1630 painting showing 1500s Stockholm. Rick Steves pages 560-561.",
          "googleMapsUrl": "https://maps.app.goo.gl/evBkJcARtqHaM1BN9",
          "photos": []
        },
        {
          "id": "stockholm-stortorget",
          "name": "Stortorget",
          "coordinates": [
            18.0706785,
            59.3251078
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Stockholm's oldest square, the heart of medieval Stockholm (pop. 6,000) in 1400. Colorful old buildings topped with gables line this square. Here at the town well, many tangled lanes intersected, making it the natural center for trading.",
          "walkingTourNotes": "Site of the Stockholm Bloodbath of 1520, when many of Stockholm's movers and shakers who had challenged Danish rule were rounded up and beheaded. Legend holds that the 80 or so gray stones in the fine red facade symbolize the victims. One victim's son escaped and later led Swedish revolt, becoming Gustav Vasa, Sweden's first king, ushering in the Swedish Renaissance.",
          "notes": "Today hosts concerts, occasional demonstrators, Christmas market in winter. Home to Nobel Prize Museum in old stock exchange building. Recommended lunch at Grillska Huset. Rick Steves pages 559-560.",
          "googleMapsUrl": "https://maps.app.goo.gl/o7z6MBjaYJVMKMAx5",
          "photos": []
        },
        {
          "id": "stockholm-nobel-museum",
          "name": "Nobel Prize Museum",
          "coordinates": [
            18.0708145,
            59.3255401
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Museum located in old stock exchange building on Stortorget square, celebrating the Nobel Prize laureates and their achievements.",
          "walkingTourNotes": "Housed in grand building that once served as Stockholm's stock exchange.",
          "notes": "Located in old stock exchange on Stortorget. Rick Steves page 559.",
          "googleMapsUrl": "https://maps.app.goo.gl/o4uDzoj2nS1ZivS4A",
          "photos": []
        },
        {
          "id": "stockholm-iron-boy",
          "name": "Iron Boy Statue (Järnpojke)",
          "coordinates": [
            18.0723612,
            59.3254829
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "The tiniest public statue (fist-sized, out of about 600) in Stockholm. Swedish grannies knit caps for him in winter. Located in the shady churchyard of the Finnish church.",
          "walkingTourNotes": "Local legend says the statue honors the orphans who had to transfer cargo from sea ships to lake ships before Stockholm's locks were built. The artist says it's simply a portrait of himself as a child, sitting on his bed and gazing at the moon.",
          "notes": "Some people rub his head for good luck, others for wisdom. Located in Finnish church churchyard (Finska Kyrkan). Rick Steves page 558.",
          "googleMapsUrl": "https://maps.app.goo.gl/Fn8PzTh24QW6Ywiy6",
          "photos": []
        },
        {
          "id": "stockholm-st-george-statue",
          "name": "St. George Statue",
          "coordinates": [
            18.0737451,
            59.3251239
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Breathtaking statue of St. George slaying the dragon, with a maiden representing Stockholm looking on with thanks and admiration. Located in Köpmantorget square surrounded by shops noted for Swedish handicrafts.",
          "walkingTourNotes": "Medieval statue in a square that represents old Stockholm's merchant culture.",
          "notes": "Surrounded by shops noted for Swedish handicrafts. Bronze copy placed in 1912, reproduction of wooden sculpture inside Storkyrkan Cathedral. Rick Steves page 559.",
          "googleMapsUrl": "https://maps.app.goo.gl/wsSq7qa2xpSwNR4c6",
          "photos": []
        },
        {
          "id": "stockholm-obelisk",
          "name": "Obelisk at Slottsbacken",
          "coordinates": [
            18.0715164,
            59.3258716
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Obelisk that honors Stockholm's merchant class for its support in a 1788 war against Russia. Located at the crest of Slottsbacken hill, facing Storkyrkan cathedral.",
          "walkingTourNotes": "Erected to commemorate merchant support during war against Russia in 1788. Considered the very centre point of the Swedish capital city.",
          "notes": "Good viewpoint to see harbor, National Museum across water, Strandvägen street buildings, and embassy row. Rick Steves page 558.",
          "googleMapsUrl": "https://maps.app.goo.gl/GYq3dPE1A15376hk6",
          "photos": []
        },
        {
          "id": "stockholm-finnish-church",
          "name": "Finnish Church (Finska Kyrkan)",
          "coordinates": [
            18.0722256,
            59.3257084
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Deep orange building opposite the Royal Palace that originated as the royal tennis hall. When Protestant Reformation hit in 1527, each merchant community needed its own church. Finns worshipped here.",
          "walkingTourNotes": "Converted from royal tennis hall to church after Protestant Reformation. Churchyard contains Iron Boy statue.",
          "notes": "Churchyard is accessible and kid-friendly. Rick Steves page 558.",
          "googleMapsUrl": "https://maps.app.goo.gl/KaYaaernsXbAHq2c9",
          "photos": []
        },
        {
          "id": "stockholm-kopmangatan",
          "name": "Köpmangatan",
          "coordinates": [
            18.072097,
            59.325118
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Quintessential Gamla Stan lane with cobbles and traditional pastel facades—one of the oldest in town. Mellow yellow houses predominantly from 18th century; reddish facades mostly 17th century. Once merchants' homes, today popular with antique dealers and refined specialty shops.",
          "walkingTourNotes": "Historic merchant street showing architectural evolution from 17th to 18th century. Once densely populated when living within city walls was common.",
          "notes": "Look for hoists poking from gables (merchants lifted goods into attics with pulleys), tie bolts (iron bars binding timber beams), coal/wood hatches, flaming gold phoenixes under red-crown medallions (firefighter insurance markers). Rick Steves pages 558-559.",
          "googleMapsUrl": "https://maps.app.goo.gl/pTBS4beXmzBefBLw8",
          "photos": []
        },
        {
          "id": "stockholm-rune-stone",
          "name": "Rune Stone (Prästgatan)",
          "coordinates": [
            18.069980,
            59.324739
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Viking-age rune stone guarded by a cannon barrel on the corner at Kåkbrinken and Prästgatan. The inscription reads: 'Torsten and Frogun erected this stone in memory of their son.'",
          "walkingTourNotes": "Ancient Nordic memorial stone from Viking age. Officially known as Uppland Runic Inscription 53, believed to date from around AD 1000, about 200 years older than the city itself.",
          "notes": "Look down at corner to see cannon barrel guard. Good example of old Stockholm preservation. Rick Steves page 562.",
          "googleMapsUrl": "https://maps.app.goo.gl/nLE6zaYo5Jbfmw9a6",
          "photos": []
        },
        {
          "id": "stockholm-prastgatan",
          "name": "Prästgatan",
          "coordinates": [
            18.0706556,
            59.3242844
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Peaceful 15th-century 'Priests' Lane' parallel to touristy Västerlånggatan. Features quintessential old Stockholm architecture with cobbles and medieval building features.",
          "walkingTourNotes": "15th-century lane showing Stockholm's merchant past. Like other Scandinavian cities, Stockholm was plagued by fire until only stone, stucco, and brick construction was allowed in town center.",
          "notes": "Look for architectural details: hoists, tie bolts, hatches, phoenixes (#46 has good example). Quieter alternative to busy Västerlånggatan. Rick Steves page 561.",
          "googleMapsUrl": "https://maps.app.goo.gl/4mDPauH8J3DaN84n7",
          "photos": []
        },
        {
          "id": "stockholm-german-church",
          "name": "German Church (Tyska Kyrkan)",
          "coordinates": [
            18.0717443,
            59.3241759
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Church with powerful brick steeple. The carillon has played four times a day since 1666. Sweden formally became a Lutheran country even before northern part of Germany—making this the very first German Lutheran church.",
          "walkingTourNotes": "Built when German merchants worked in Stockholm. Reflects German cultural influence on art, building styles, and language in old Stockholm.",
          "notes": "Mon-Sat 10:30-16:30, Sun 14:30-16:30. Churchyard can be explored. Rick Steves page 562.",
          "googleMapsUrl": "https://maps.app.goo.gl/Fp8Bx5ZRvrfmaFnP7",
          "photos": []
        },
        {
          "id": "stockholm-osterlangatan-viewpoint",
          "name": "Viewpoint (Österlånggatan overlook)",
          "coordinates": [
            18.073513,
            59.323431
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Iron railing perch overlooking Österlånggatan street. From here you can survey how the street curves, marking the old shoreline. The lane leads to the water, showing how medieval piers stretched into harbor.",
          "walkingTourNotes": "In medieval times, piers stretched out like fingers into the harbor. Gradually, as land was reclaimed and developed, these piers were extended, becoming lanes leading to piers ever farther away.",
          "notes": "Good spot to understand Stockholm's medieval geography and land reclamation history. Rick Steves pages 562-563.",
          "googleMapsUrl": "https://maps.app.goo.gl/jG9iGGz2DwGRWG6S6",
          "photos": []
        },
        {
          "id": "stockholm-jarntorget",
          "name": "Järntorget",
          "coordinates": [
            18.0734657,
            59.3228461
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "A customs square in medieval times, home of Sweden's first bank back in 1680 (yellow building with bars on windows). Today features Co-op Nära supermarket for picnic fixings. From here, Västerlånggatan—the touristy pedestrian mall—leads back across the island.",
          "walkingTourNotes": "Medieval customs square where trade was conducted and taxed. Second oldest square in Stockholm.",
          "notes": "Good spot for picnic supplies. Connection point to Västerlånggatan shopping street. Rick Steves page 563.",
          "googleMapsUrl": "https://maps.app.goo.gl/F2FX6szSCD2TzQwu5",
          "photos": []
        },
        {
          "id": "stockholm-slussen-bridge",
          "name": "Bridge Overlooking Slussen",
          "coordinates": [
            18.073631,
            59.321213
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Area called Slussen, named for the locks between the salt water of the Baltic Sea and the fresh water of huge Lake Mälaren. Stockholm exists because this is where Lake Mälaren meets the sea.",
          "walkingTourNotes": "In the 13th century, the new kingdom of Sweden began levying duty taxes on all the iron, copper, and furs shipped through here. Traders would sail goods from far inland to this point to meet merchants who would ship goods south to Europe. Today the locks are nicknamed 'the divorce lock' because this is where captains and first mates learn to communicate under pressure.",
          "notes": "Notice the current in the water from the weir being lowered. Water spills from Lake Mälaren (about two feet above sea level) into the sea. Rick Steves page 563.",
          "googleMapsUrl": "https://maps.app.goo.gl/jNqTh2ktZCyGWFn96",
          "photos": []
        },
        {
          "id": "stockholm-golden-bridge",
          "name": "Golden Bridge (Viewing point)",
          "coordinates": [
            18.073694,
            59.321218
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Bridge made in China offering excellent views of Södermalm neighborhood, cruise ships, Gröna Lund amusement park, and Djurgården island with top Stockholm attractions (Skansen, Nordic Museum, Vasa Museum). Also view of Af Chapman sailing ship youth hostel and ferries to Djurgården.",
          "walkingTourNotes": "Modern bridge providing panoramic view of Stockholm's key districts and attractions. Also known as Guldbron or Slussbron, officially opened in October 2020.",
          "notes": "Walk ends here. Can backtrack along Västerlånggatan, visit Gamla Stan sights, or hop ferry to Djurgården. Can also walk 15 minutes to Kungsträdgården for Modern City Walk. Rick Steves pages 563-564.",
          "googleMapsUrl": "https://maps.app.goo.gl/hHMWTiPkkFDWVZjW9",
          "photos": []
        },
        {
          "id": "stockholm-kungstradgarden",
          "name": "Kungsträdgården",
          "coordinates": [
            18.071753,
            59.330792
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Stockholm's \"living room\" - a downtown park and people-watching center",
          "walkingTourNotes": "Former royal kitchen garden, now a symbol of Swedish freedom. The elm trees were saved by protesters in the 1970s who chained themselves to prevent subway construction. Hosts cultural festivals and events throughout the year.",
          "notes": "Look for the statue of King Karl XII facing the waterfront, the Japanese cherry tree trellis by the fountain, and the revolving NK clock as a landmark. Popular venue for concerts and festivals.",
          "googleMapsUrl": "https://maps.app.goo.gl/fJNkrwkyCpLxw92E7",
          "photos": []
        },
        {
          "id": "stockholm-holocaust-monument",
          "name": "Holocaust Monument & Synagogue",
          "coordinates": [
            18.073389,
            59.331512
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Memorial honoring Holocaust victims and Swedish diplomat Raoul Wallenberg",
          "walkingTourNotes": "Located a half-block down Wahrendorffsgatan street from Kungsträdgården. Stockholm's central synagogue is behind security bollards. A wall in the courtyard is etched with names of Swedish Nazi victims. Train tracks symbolize the journey to concentration camps, leading to Wallenberg's memorial with abstract coffin-like markers.",
          "notes": "Raoul Wallenberg showed Schindler-like heroism saving Jews during WWII",
          "googleMapsUrl": "https://maps.google.com/maps?q=59.332063,18.07535",
          "photos": []
        },
        {
          "id": "stockholm-hamngatan",
          "name": "Urban Shopping Zone (Hamngatan)",
          "coordinates": [
            18.069840,
            59.332720
          ],
          "category": "practical",
          "visibility": "walkingTour",
          "description": "Major shopping street with Swedish consumer landmarks",
          "walkingTourNotes": "Street running from Kungsträdgården showcasing Swedish consumerism. Walk the length of the NK department store to reach Gallerian mall and beyond.",
          "notes": "Main commercial corridor in modern Stockholm",
          "googleMapsUrl": "https://maps.app.goo.gl/BZ1Kw87JpKjXRUeS6",
          "photos": []
        },
        {
          "id": "stockholm-nk",
          "name": "Nordiska Kompaniet (NK)",
          "coordinates": [
            18.0691707,
            59.3331523
          ],
          "category": "practical",
          "visibility": "walkingTour",
          "description": "Iconic department store (locals joke NK = \"no kronor left\")",
          "walkingTourNotes": "Elegant early-20th-century building (circa 1910) inspired by grand American department stores. The giant gold NK marking is a landmark. Features a revolving clock visible across Kungsträdgården.",
          "notes": "High-end shopping destination, landmark building at top of Kungsträdgården",
          "googleMapsUrl": "https://maps.app.goo.gl/UL5jTaPZkPGJX5xU7",
          "photos": []
        },
        {
          "id": "stockholm-gallerian",
          "name": "Gallerian Mall",
          "coordinates": [
            18.0674676,
            59.3312202
          ],
          "category": "practical",
          "visibility": "walkingTour",
          "description": "Modern two-story shopping mall with diverse Swedish retailers",
          "walkingTourNotes": "Sleek modern mall across from Hamngatan #26. Features Clas Ohlson (hardware/electronics), Lagerhaus (Swedish home design), Akademibokhandeln (bookstore), and Ikea. Welcoming info desk, food court, and cafes for traditional fika (Swedish coffee break). American chains challenging traditional Swedish culture.",
          "notes": "Behind Gallerian, streets near NK have exclusive designer boutiques and chichi Mood Stockholm mall",
          "googleMapsUrl": "https://maps.app.goo.gl/LhPTzPhTUQjhzRxU7",
          "photos": []
        },
        {
          "id": "stockholm-sergels-torg",
          "name": "Sergels Torg",
          "coordinates": [
            18.0645449,
            59.3323565
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Modern plaza with iconic 1960s architecture and glass tower",
          "walkingTourNotes": "Heart of modern Stockholm with stark 1960s-era architecture. The glassy tower fountain glows at night symbolizing northern lights (and pride flags, solidarity causes). The sunken square \"Plattan\" (the platter) was revitalized from 1970s junkie zone to people-friendly commercial heart. Stockholmsrummet (Sergelgången 31, lower level) shows 1:1000 city model.",
          "notes": "Tram #7 from here goes to Skansen and Djurgården. Major department stores H&M and Åhléns nearby",
          "googleMapsUrl": "https://maps.app.goo.gl/iPWknxUhWHU7PfTQ8",
          "photos": []
        },
        {
          "id": "stockholm-kulturhuset",
          "name": "Kulturhuset",
          "coordinates": [
            18.064340,
            59.332046
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Stockholm's culture center overlooking Sergels Torg",
          "walkingTourNotes": "Hulking low-slung glassy building from 1960s-70s. Hosts libraries, theater, kids' zone, chessboards, shops, fine-art cinema, art exhibits, and music venue. Cafeteria Panorama on rooftop has cheap meals with city views. Ground floor has free EU exhibit. Take elevator to top and ride escalator down exploring each level.",
          "notes": "+46 8 5062 0200, http://kulturhusetstadsteatern.se",
          "googleMapsUrl": "https://maps.app.goo.gl/rvW1eqU5f78rZuzW6",
          "photos": []
        },
        {
          "id": "stockholm-sergelgatan",
          "name": "Sergelgatan",
          "coordinates": [
            18.064051,
            59.333049
          ],
          "category": "practical",
          "visibility": "walkingTour",
          "description": "Thriving pedestrian shopping street with public art",
          "walkingTourNotes": "Pedestrian commercial street with five white office towers (1960s-era, now struggling). Features Avicii Experience museum (Sergelgatan 2, dedicated to Swedish DJ/producer). Gun-tied-in-knot statue symbolizes Swedish neutrality (no war since 1814, neutral in WWI/WWII). Designtorget shop (#20, near T-bana) has whimsical Swedish design.",
          "notes": "Swedish music industry (ABBA, Avicii, Spotify) is major economic force. Most Swedish pop sung in English for wider audience.",
          "googleMapsUrl": "https://maps.app.goo.gl/4GPGYZpor4hcBP9Z6",
          "photos": []
        },
        {
          "id": "stockholm-hotorget",
          "name": "Hötorget",
          "coordinates": [
            18.0622352,
            59.3348172
          ],
          "category": "food",
          "visibility": "walkingTour",
          "description": "\"Hay Market\" square with outdoor stalls and indoor market hall",
          "walkingTourNotes": "Market square at end of walk. Outdoor stalls and Hötorgshallen indoor market (1914, when city banned outdoor fish/meat sales for hygiene). Sunday flea market in summer. Carl Milles' Orpheus statue faces Konserthuset concert hall (1926 Swedish Art Deco \"Swedish Grace\", hosts Nobel Prize ceremony). Free student concerts in summer (5/day, 20 min each). Hötorget T-bana station showcases 1950s modern art design.",
          "notes": "Walk ends here. For Old Town: go to Drottninggatan, turn left toward parliament and Gamla Stan",
          "googleMapsUrl": "https://maps.app.goo.gl/QNuN39Wft7R2qYtQ7",
          "photos": []
        }
      ]
    },
    {
      "id": "copenhagen",
      "name": "Copenhagen (CPH)",
      "country": "Denmark",
      "countryCode": "DK",
      "centerCoordinates": [
        12.5683,
        55.6761
      ],
      "pois": [
        {
          "id": "copenhagen-city-hall",
          "name": "Rådhuspladsen - City Hall",
          "coordinates": [
            12.57016,
            55.67528
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Copenhagen's historic city hall and central square, a major gathering place and tourist hub in the heart of the city. Dominated by the tower of the City Hall.",
          "walkingTourNotes": "For 700 years, Copenhagen was contained within its city walls, and this square was its fortified west end. By the mid-1800s, 140,000 people were packed inside. The overcrowding led to hygiene problems and a cholera outbreak that killed 5,000. The formidable town walls survive today only in echoes—a circular series of roads and remnants of moats, which are now people-friendly city lakes. Rådhuspladsen is where the city gathers to celebrate.",
          "notes": "rs.p77 - climb the tower, check the clock opposite to info desk",
          "googleMapsUrl": "https://maps.app.goo.gl/G51SXXpYj5FkVQDZ7",
          "photos": []
        },
        {
          "id": "copenhagen-tivoli-gardens",
          "name": "Tivoli Gardens",
          "coordinates": [
            12.570259,
            55.674289
          ],
          "category": "culture",
          "visibility": "always",
          "description": "One of the world's oldest operating amusement parks. Features beautiful gardens, vintage rides, concerts, and seasonal decorations that inspired Walt Disney.",
          "walkingTourNotes": "Tivoli Gardens was founded in 1843 when magazine publisher Georg Carstensen convinced the king to build a pleasure garden outside the walls of crowded Copenhagen. The king believed happy people would care less about fighting for democracy. Tivoli became Europe's first great public amusement park and later inspired Walt Disney when he visited in the 1950s.",
          "notes": "rs,p75",
          "googleMapsUrl": "https://maps.app.goo.gl/8JbhfJdFGx5mqs997",
          "photos": []
        },
        {
          "id": "copenhagen-vesterbrogade-weather-girls",
          "name": "Vesterbrogade (Weather Girls)",
          "coordinates": [
            12.567431,
            55.675714
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "The big, broad boulevard is Vesterbrogade ('Western Way'), which led to the western gate of the medieval city (behind you, where the pedestrian boulevard begins). Here, in the traffic hub of this huge city, you'll notice...not many cars. Throughout Copenhagen, you'll see how the mayor's mantra, 'We will build a city not for cars but for people'—along with tax-and-regulation policies that encourage small electric cars and use of public transit and bikes—is shaping the city.",
          "notes": "The golden weather girls (on the corner, high above Vesterbrogade) indicate the weather: on a bike (fair weather) or with an umbrella (foul).",
          "googleMapsUrl": "https://maps.app.goo.gl/hftgTNZ3YBGoUr7P6",
          "photos": []
        },
        {
          "id": "copenhagen-stroget",
          "name": "Strøget",
          "coordinates": [
            12.571151,
            55.677276
          ],
          "category": "culture",
          "visibility": "always",
          "description": "Europe's first fully pedestrianized street, now Copenhagen's main shopping boulevard from City Hall to Nyhavn.",
          "walkingTourNotes": "Finished in 1962, Copenhagen's experimental, tremendously successful, and much-copied pedestrian shopping mall is a string of lively streets and squares that bunny-hop through the old town from City Hall to the Nyhavn quarter, a 20-minute stroll. This was Europe's first great public pedestrian street.",
          "notes": "Europe's first fully pedestrianized street - great for shopping and people watching",
          "googleMapsUrl": "https://maps.app.goo.gl/qarUJG81u1yp4Z1ZA",
          "photos": []
        },
        {
          "id": "copenhagen-st-peters-church",
          "name": "St. Peter's Church (Sankt Petri Kirke)",
          "coordinates": [
            12.5674228,
            55.6796027
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Historic brick church that served Copenhagen's German merchant community, still holding services in German today. Features a distinctive 17th-century brick funerary chapel at ground level.",
          "walkingTourNotes": "The ground-floor funerary chapel, unusual for being built at soil level rather than below ground, houses elaborate German tombs that showcase the wealth and influence of these merchants.",
          "notes": "Church and burial chapels open Thu-Sat 11:00-15:00. Pass funky shops in the surrounding area while exploring.",
          "googleMapsUrl": "https://maps.app.goo.gl/n1yz9Z4BhkLgcvgv5",
          "photos": []
        },
        {
          "id": "copenhagen-cathedral-our-lady",
          "name": "Cathedral of Our Lady (Vor Frue Kirke)",
          "coordinates": [
            12.5718057,
            55.6794409
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Copenhagen's main cathedral with Neoclassical Greek temple facade and Thorvaldsen's masterpiece sculptures of the 12 apostles.",
          "walkingTourNotes": "The cathedral celebrates Denmark's break from the Roman Catholic Church to become Lutheran in 1536. King Christian III presided over the council meeting when they decided to break away from Rome. Because of the reforms of 1536, there's no Mary in the Cathedral of Our Lady. The church burned down in the 1807 British bombardment during the Napoleonic Wars. Rebuilt in Neoclassical style, the cathedral's facade looks like a Greek temple. The interior features the 12 apostles clad in classical robes—masterpieces by the great Danish sculptor Bertel Thorvaldsen. They lead to a statue of the Risen Christ, standing where Zeus would have been.",
          "notes": "Free entry - see Thorvaldsen's apostle sculptures",
          "googleMapsUrl": "https://maps.app.goo.gl/dK5eHt8tkPknQpqPA",
          "photos": []
        },
        {
          "id": "copenhagen-university",
          "name": "Copenhagen University",
          "coordinates": [
            12.571456,
            55.680041
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Now home to nearly 40,000 students, this university was founded by the king in the 15th century. Today tuition is free.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/CVpB7YsXHLer75oZ9",
          "photos": []
        },
        {
          "id": "copenhagen-gammeltorv",
          "name": "Gammeltorv",
          "coordinates": [
            12.572248,
            55.678121
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Gammeltorv ('Old Square'), the town center, features the Fountain of Charity (Caritas) (early 1600s), which provided drinking water to locals since the early 1600s. Featuring a pregnant woman squirting water from her breasts next to a boy urinating, this was deemed too racy for people of the Victorian Age.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/DJ8useVPF6ymH8i3A",
          "photos": []
        },
        {
          "id": "copenhagen-nytorv",
          "name": "Nytorv",
          "coordinates": [
            12.572843,
            55.67771
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "While Gammeltorv was the place of happiness and merriment, Nytorv ('New Square') was a place of severity and judgment. The square is Neoclassical (built mostly after the 1807 British bombardment). Look down at the pavement and read the plaque: 'Here stood the town's Kag (whipping post) until 1780.'",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/8gobggnTHNxqmWpW9",
          "photos": []
        },
        {
          "id": "copenhagen-amagertorv",
          "name": "Amagertorv",
          "coordinates": [
            12.5742328,
            55.6785557
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "This square is prime real estate for talented street entertainers. Walk past the flagship Lego store (on right) to the stately brick Holy Ghost Church (Helligåndskirken). The hospital nearby is an antiques hall.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/QeZzPn1uA3EHWTYD9",
          "photos": []
        },
        {
          "id": "copenhagen-grabroedretorv",
          "name": "Gråbrødretorv",
          "coordinates": [
            12.5759959,
            55.6797519
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Surrounded by fine old buildings, this leafy and beer-stained 'Grey Friars' Square'—a monastic square until the Reformation made it a people's square—is popular for an outdoor meal or drink in the summer.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/yNEyVkXNiG7ATQw99",
          "photos": []
        },
        {
          "id": "copenhagen-bishop-absalon-statue",
          "name": "Bishop Absalon Statue",
          "coordinates": [
            12.5800008,
            55.677975
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Looking downhill from the fountain, about halfway to the imposing palace in the distance, you'll see a great man on a horse. Walk here to view this statue of Copenhagen's founder, Bishop Absalon, shown in his Warrior Absalon getup.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/aiM81fNuC4E9TftV7",
          "photos": []
        },
        {
          "id": "copenhagen-christiansborg-palace",
          "name": "Christiansborg Palace",
          "coordinates": [
            12.58034,
            55.67655
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Historic palace complex that houses the Danish Parliament, Supreme Court, and Prime Minister's Office, with beautiful royal reception rooms.",
          "walkingTourNotes": "You're stepping onto Slotsholmen ('Castle Island'), the easy-to-defend birthplace of Copenhagen in the 12th century. This is Denmark's power island, with the Folketinget (Danish parliament), Supreme Court, Ministry of Finance, and the historic Børsen stock exchange. The seat of Danish government today is considered the birthplace of Copenhagen, dominated by the royal palace complex with its distinctive 'three crowns' spire.",
          "notes": "rs, p83",
          "googleMapsUrl": "https://maps.app.goo.gl/yVJQWuhx1P9sQmrcA",
          "photos": []
        },
        {
          "id": "copenhagen-borsen",
          "name": "Børsen - Historic Stock Exchange",
          "coordinates": [
            12.5835082,
            55.6755127
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Historic red-brick stock exchange.",
          "walkingTourNotes": "The eye-catching red-brick stock exchange was inspired by the Dutch Renaissance. Built to promote the mercantile ambitions of Denmark in the 1600s, it was the 'World Trade Center' of Scandinavia. Its dragon-tail spire with three crowns represents the Danish aspiration to rule a united Scandinavia—or at least be its commercial capital.",
          "notes": "Not open to tourists - exterior viewing only",
          "googleMapsUrl": "https://maps.app.goo.gl/ZokTSDqYdWaqyZBL9",
          "photos": []
        },
        {
          "id": "copenhagen-havnegade-promenade",
          "name": "Havnegade Promenade",
          "coordinates": [
            12.5899562,
            55.676846
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "The Havnegade promenade to Nyhavn is a delightful people zone with trampolines (stop for a bounce), an ice-cream-licking ambience, and harborview benches.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/yYUVeQe4fFWXgw2m9",
          "photos": []
        },
        {
          "id": "copenhagen-kissing-bridge",
          "name": "Inderhavnsbroen Sliding Bridge (Kissing Bridge)",
          "coordinates": [
            12.5947366,
            55.6785035
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "From here, stroll several more blocks toward the Inderhavnsbroen sliding bridge for pedestrians and bikes. This 'kissing bridge' is called that because the two sliding, or retractable, sections 'kiss' when they come together. It links the town center with Christianshavn and makes the modern Opera House (ahead on the right, across the water) more accessible.",
          "notes": "",
          "googleMapsUrl": "https://maps.app.goo.gl/ARiGxX9fdEVkEwjC6",
          "photos": []
        },
        {
          "id": "copenhagen-nyhavn",
          "name": "Nyhavn - New Harbor",
          "coordinates": [
            12.5882235,
            55.6797705
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Iconic canal lined with colorful 17th-century townhouses, restaurants, and historic sailing ships. Hans Christian Andersen lived here.",
          "walkingTourNotes": "Established in the 1670s along with Kongens Nytorv, Nyhavn ('New Harbor') is a recently gentrified sailors' quarter. The canal is filled with glamorous old sailboats of all sizes—Copenhagen's ever-changing boat museum. Hans Christian Andersen lived and wrote his first stories here in the red double-gabled building at #20.",
          "notes": "Perfect for canal-side dining and people watching",
          "googleMapsUrl": "https://maps.app.goo.gl/trCFNNVr4T8TMfkj8",
          "photos": []
        },
        {
          "id": "copenhagen-kongens-nytorv",
          "name": "Kongens Nytorv - King's New Square",
          "coordinates": [
            12.5830191,
            55.6799792
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "Grand baroque square with Royal Theater, luxury hotels, and equestrian statue of Christian V. Major Metro station and cultural center.",
          "walkingTourNotes": "The 'King's New Square' is home to the Royal Theater, French embassy, and Hotel d'Angleterre where VIPs and pop stars stay. The equestrian statue of Christian V celebrates the king who made this square the city's geographical and cultural center. In past winters, this was a popular ice-skating rink.",
          "notes": "Metro hub and luxury shopping area",
          "googleMapsUrl": "https://maps.app.goo.gl/XMz6v1hSA8LHWRRJ9",
          "photos": []
        },
        {
          "id": "copenhagen-amalienborg-palace",
          "name": "Amalienborg Palace",
          "coordinates": [
            12.59302,
            55.68405
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "The palace where the king lives, with the changing of the guard at noon.",
          "walkingTourNotes": "Queen Margrethe II, who abdicated the throne in 2024, lives in the mansion to your immediate left as you enter the square from the harborside. The mansion across the street is where her son, King Frederik X, lives with his wife Queen Mary—an Australian businesswoman—and their four children. The guards change daily at noon. The equestrian statue of Frederik V is a reminder that this square was the centerpiece of a planned town he envisioned in 1750.",
          "notes": "rs,p89 - changing of the guard at noon",
          "googleMapsUrl": "https://maps.app.goo.gl/6AyATeWaLgy5nt4E8",
          "photos": []
        },
        {
          "id": "copenhagen-little-mermaid",
          "name": "The Little Mermaid",
          "coordinates": [
            12.59928,
            55.69286
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Bronze statue inspired by Hans Christian Andersen's fairy tale, created by sculptor Edvard Eriksen in 1913. Despite being smaller than expected, it's one of Copenhagen's most famous symbols.",
          "walkingTourNotes": "Gift to Copenhagen in 1909 from brewing magnate Carl Jacobsen. Inspired by a ballet performance of Andersen's story, Jacobsen hired Eriksen to immortalize the mermaid. Eriksen used his wife Eline as the model. The statue sat unappreciated for 40 years until Danny Kaye sang 'Wonderful Copenhagen' in the 1952 movie 'Hans Christian Andersen', and the tourist board decided to use the mermaid as a marketing symbol.",
          "notes": "Small but iconic statue - best photos from the rocks nearby",
          "googleMapsUrl": "https://maps.app.goo.gl/g8VD9gNTFnfKVTxR9",
          "photos": []
        },
        {
          "id": "copenhagen-round-tower",
          "name": "Round Tower (Rundetårn)",
          "coordinates": [
            12.57573,
            55.68134
          ],
          "category": "landmark",
          "visibility": "walkingTour",
          "description": "17th-century tower with a unique spiral ramp leading to an observatory with panoramic views of Copenhagen. Built between 1637-1642 by King Christian IV as an astronomical observatory, featuring a 7.5-turn helical corridor (equestrian staircase) leading to the observation platform 34.8 meters above ground.",
          "walkingTourNotes": "Designed by Hans van Steenwinckel the Younger, the Round Tower is part of the Trinitatis Complex which includes a chapel and the first facilities of the Copenhagen University Library founded in 1482. The unique spiral ramp was designed so horses could pull heavy astronomical equipment to the top. Today it serves as a public observation tower, astronomical observatory, and exhibition venue.",
          "notes": "rs,p88 - Observatory, check the open hours",
          "googleMapsUrl": "https://maps.app.goo.gl/mtYcKoPAtVRDFJne7",
          "photos": []
        },
        {
          "id": "copenhagen-royal-library",
          "name": "Det Kgl. Bibliotek (The Royal Library)",
          "coordinates": [
            12.58265,
            55.67339
          ],
          "category": "culture",
          "visibility": "walkingTour",
          "description": "Denmark's national library, nicknamed \"Black Diamond\" for its striking modern architecture with shiny black granite cladding.",
          "notes": "rs,p88",
          "googleMapsUrl": "https://maps.app.goo.gl/Bp3VkKaqgMjSK6gz8",
          "photos": []
        },
        {
          "id": "copenhagen-church-our-saviour",
          "name": "Church of Our Saviour",
          "coordinates": [
            12.59421,
            55.67293
          ],
          "category": "landmark",
          "visibility": "always",
          "description": "Spiral spire",
          "notes": "rs,p98",
          "googleMapsUrl": "https://maps.app.goo.gl/pYd8rgqaseTAAH77A",
          "photos": []
        },
        {
          "id": "copenhagen-fisketorvet-pool",
          "name": "Fisketorvet - Open Water Swimming Pool",
          "coordinates": [
            12.56357,
            55.66268
          ],
          "category": "culture",
          "visibility": "always",
          "description": "Harbour bath",
          "notes": "rs,p106",
          "googleMapsUrl": "https://maps.app.goo.gl/mBXwWE82PqDFpBN3A",
          "photos": []
        },
        {
          "id": "copenhagen-islands-brygge",
          "name": "Islands Brygge Havnepark",
          "coordinates": [
            12.57881,
            55.66816
          ],
          "category": "culture",
          "visibility": "always",
          "description": "Harbour bath",
          "notes": "rs,p106",
          "googleMapsUrl": "https://maps.app.goo.gl/mJPrSdZbUVVepXp59",
          "photos": []
        },
        {
          "id": "copenhagen-residence-inn",
          "name": "Residence Inn Copenhagen Nordhavn",
          "coordinates": [
            12.5981343,
            55.7073923
          ],
          "category": "hotel",
          "visibility": "always",
          "description": "Extended-stay hotel in the modern Nordhavn district with apartment-style suites, perfect for longer stays with kitchen facilities and spacious accommodations.",
          "notes": "Address: Tallinngade 12, Copenhagen, Denmark 2150 - Phone: +4530308124",
          "googleMapsUrl": "https://maps.app.goo.gl/XghNPWQiQAAjwP6d9",
          "photos": []
        }
      ]
    },
    {
      "id": "malmo",
      "name": "Malmö (MMX)",
      "country": "Sweden",
      "countryCode": "SE",
      "centerCoordinates": [
        13.0007,
        55.605
      ],
      "pois": [
        {
          "id": "malmo-turning-torso",
          "name": "Turning Torso",
          "coordinates": [
            12.9766806,
            55.6132075
          ],
          "category": "landmark",
          "description": "Neo-futurist architectural marvel designed by Santiago Calatrava, completed in 2005. At 190 meters tall, it's the tallest building in Scandinavia, with a distinctive twisted design rotating 90 degrees from base to top.",
          "notes": "Tallest building in Scandinavia with twisted architecture - visible from Copenhagen across the Öresund Bridge",
          "googleMapsUrl": "https://maps.app.goo.gl/Noe5gYxnNxjfPJsW6",
          "photos": [],
          "visibility": "always"
        }
      ]
    }
  ],
  "walkingTours": {
    "munich": [
      {
        "id": "munich-historic-center",
        "name": "Historic Munich Center",
        "description": "Explore Munich's medieval heart from Karlsplatz through the historic center to the famous beer garden",
        "difficulty": "easy",
        "estimatedTime": "3-4 hours",
        "distance": "2.5 km",
        "poiSequence": [
          "munich-karlsplatz",
          "munich-frauenkirche",
          "munich-marienplatz",
          "munich-st-peter-church",
          "munich-viktualienmarkt"
        ]
      }
    ],
    "copenhagen": [
      {
        "id": "copenhagen-city-walk",
        "name": "Copenhagen City Walk",
        "description": "2-hour self-guided walk from City Hall through Strøget to Nyhavn, exploring Copenhagen's history and culture",
        "difficulty": "easy",
        "estimatedTime": "2 hours",
        "distance": "~3 km",
        "mapImage": "/maps/copenhagen-city-walk.jpg",
        "poiSequence": [
          "copenhagen-city-hall",
          "copenhagen-tivoli-gardens",
          "copenhagen-vesterbrogade-weather-girls",
          "copenhagen-stroget",
          "copenhagen-st-peters-church",
          "copenhagen-university",
          "copenhagen-cathedral-our-lady",
          "copenhagen-gammeltorv",
          "copenhagen-nytorv",
          "copenhagen-amagertorv",
          "copenhagen-grabroedretorv",
          "copenhagen-round-tower",
          "copenhagen-bishop-absalon-statue",
          "copenhagen-christiansborg-palace",
          "copenhagen-royal-library",
          "copenhagen-borsen",
          "copenhagen-havnegade-promenade",
          "copenhagen-kissing-bridge",
          "copenhagen-nyhavn",
          "copenhagen-kongens-nytorv",
          "copenhagen-amalienborg-palace",
          "copenhagen-little-mermaid"
        ]
      }
    ],
    "helsinki": [
      {
        "id": "helsinki-city-walk",
        "name": "Helsinki City Walk",
        "description": "Self-guided walk from Market Square to Oodi Library, exploring Helsinki's history and modern culture",
        "difficulty": "easy",
        "estimatedTime": "1.5 hours",
        "distance": "~2 km",
        "mapImage": "/maps/helsinki-city-walk.jpg",
        "poiSequence": [
          "helsinki-market-square",
          "helsinki-senate-square",
          "helsinki-cafe-kappeli",
          "helsinki-iittala-arabia-aarikka",
          "helsinki-esplanadi",
          "helsinki-artek-marimekko-stockmann",
          "helsinki-three-blacksmiths",
          "helsinki-central-train-station",
          "helsinki-oodi-library"
        ]
      }
    ],
    "tallinn": [
      {
        "id": "tallinn-walk",
        "name": "Tallinn Walk",
        "description": "Self-guided walk through Tallinn's lower and upper towns, exploring medieval Hanseatic heritage",
        "difficulty": "moderate",
        "estimatedTime": "2 hours",
        "distance": "~2.5 km",
        "mapImage": "/maps/tallinn-walk.jpg",
        "poiSequence": [
          "tallinn-fat-margaret",
          "tallinn-pikk-street",
          "tallinn-brotherhood-black-heads",
          "tallinn-great-guild-hall",
          "tallinn-church-holy-ghost",
          "tallinn-town-hall-square",
          "tallinn-st-nicholas-church",
          "tallinn-kiek-in-de-kok",
          "tallinn-alexander-nevsky-cathedral",
          "tallinn-toompea-castle",
          "tallinn-tall-hermann-tower",
          "tallinn-dome-church",
          "tallinn-patkuli-viewing-platform",
          "tallinn-kohtuotsa-viewpoint",
          "tallinn-viru-gate",
          "tallinn-hotel-viru-kgb"
        ]
      }
    ],
    "stockholm": [
      {
        "id": "stockholm-gamla-stan-walk",
        "name": "Gamla Stan Walk",
        "description": "Self-guided walk through Stockholm's historic Old Town, exploring medieval streets, the Royal Palace, and Stockholm's oldest square",
        "difficulty": "easy",
        "estimatedTime": "1-2 hours",
        "distance": "~1.5 km",
        "mapImage": "/maps/stockholm-gamla-stan-walk.jpg",
        "poiSequence": [
          "stockholm-royal-palace",
          "stockholm-obelisk",
          "stockholm-iron-boy",
          "stockholm-st-george-statue",
          "stockholm-stortorget",
          "stockholm-storkyrkan",
          "stockholm-rune-stone",
          "stockholm-german-church",
          "stockholm-osterlangatan-viewpoint",
          "stockholm-jarntorget",
          "stockholm-slussen-bridge",
          "stockholm-golden-bridge"
        ]
      },
      {
        "id": "stockholm-modern-city-walk",
        "name": "Modern City Walk",
        "description": "Explore the modern center of Stockholm from Kungsträdgården park through shopping districts to Hötorget market",
        "difficulty": "easy",
        "estimatedTime": "1.5-2 hours",
        "distance": "~2 km",
        "mapImage": "/maps/stockholm-modern-city-walk.jpg",
        "poiSequence": [
          "stockholm-kungstradgarden",
          "stockholm-holocaust-monument",
          "stockholm-hamngatan",
          "stockholm-nk",
          "stockholm-gallerian",
          "stockholm-sergels-torg",
          "stockholm-kulturhuset",
          "stockholm-sergelgatan",
          "stockholm-hotorget"
        ]
      }
    ]
  }
}